app/views/webpages/home/_featured.html.haml

.left-rounded.feature
  = render :partial => display_preview(widgets.first.widget), :locals => {:widget => widgets.first}
.feature.middle
---
SELECT `widgets`.* FROM `widgets` WHERE (`widgets`.gadget_id = 1 AND `widgets`.gadget_type = 'Webpage') AND (widget NOT IN (70,10) AND position => 0) LIMIT 1