app/views/templates/_sales.html.haml

  - else
    - unless object.other_subpages.blank?
---
SELECT `subpages`.* FROM `subpages` WHERE (`subpages`.webpage_id = 3) LIMIT 0, 4