app/views/widgets/_featured_page.html.haml

SELECT `images`.* FROM `images` WHERE (`images`.attachable_id = 4 AND `images`.attachable_type = 'Subpage') AND (`images`.`enabled` = 1) ORDER BY position LIMIT 1
---
%h4= widget.specific_content.page_title
= image_tag widget.specific_content.images.first_enabled.url(:sm_preview), :class => 'floatLeft' unless widget.specific_content.images.blank?