app/views/widgets/content_fields/_select_page.html.haml

SELECT `widgets`.* FROM `widgets` WHERE (`widgets`.gadget_id = 1 AND `widgets`.gadget_type = 'Webpage')
---
.formfield
  = w.select :content, options_for_select(Widget.available_featured_pages(w.object))