app/controllers/images_controller.rb

  def update_status
    @image  = Image.find(params[:id])
    @object = @image.attachable_type.constantize.find(@image.attachable_id)
    enabled = params[:enable] == 'true'
    href = '/images/slideshow_edit'

    respond_to do |format|
      format.html {}
      format.js do
        @image.update_attribute('enabled', enabled)
---
SELECT `images`.* FROM `images` WHERE (`images`.attachable_id = 1 AND `images`.attachable_type = 'Webpage')
SELECT id FROM `images` WHERE (`images`.`attachable_id` = 1)
UPDATE `images` SET `enabled` = 1, `updated_at` = '2011-05-01 17:44:23' WHERE (`images`.`id` = 1)

  def order
    @image = Image.find(params[:id])
    object = @image.attachable_type.constantize.find(@image.attachable_id)
---
SELECT `images`.* FROM `images` WHERE (`images`.attachable_id = 1 AND `images`.attachable_type = 'Subpage')
SELECT id FROM `images` WHERE (`images`.`attachable_id` = 1)