app/controllers/subpages_controller.rb

  def show
    @subpage = Subpage.find(:first, :conditions => {:page_alias => params[:page_alias]})
---
SELECT `subpages`.* FROM `subpages` WHERE (`subpages`.`page_alias` = 'html5_reset') LIMIT 1

  def edit
    @subpage = Subpage.find(params[:id])
---
SELECT `subpages`.* FROM `subpages` WHERE (`subpages`.`id` = 1) LIMIT 1

  def update
    @subpage = Subpage.find(params[:id])
    @subpage.images.build(params[:images]) if params[:images]

    if @subpage.update_attributes(params[:subpage])
---
SELECT `subpages`.* FROM `subpages` WHERE (`subpages`.`id` = 4) LIMIT 1
UPDATE `subpages` SET `preview_text` = 'Nam gravida ipsum ut ligula congue tincidunt. Duis nec placerat lectus. Nunc vestibulum, lacus eu tincidunt placerat, orci nisi pretium just', `updated_at` = '2011-05-01 17:58:45' WHERE (`subpages`.`id` = 4)

  def set_accessability
    subpage = Subpage.find(params[:sub].to_i)
    webpage = subpage.webpage
    enable = params[:enable] == "true"

    respond_to do |format|
      format.html {}
      format.js do
        subpage.update_attribute('enabled', enable)
---
SELECT `subpages`.* FROM `subpages` WHERE (`subpages`.`id` = 3) LIMIT 1
UPDATE `subpages` SET `enabled` = 1, `updated_at` = '2011-04-10 17:59:38' WHERE (`subpages`.`id` = 3)
UPDATE `webpages` SET `enabled` = 1, `updated_at` = '2011-04-10 17:59:38' WHERE (`webpages`.`id` = 4)