app/controllers/webpages_controller.rb

  def show
    @webpage = params[:page_alias] ? Webpage.find(:first, :conditions => {:page_alias => params[:page_alias]}) : Webpage.current_root
    @subpages = @webpage.subpages.paginate(:page => params[:page], :per_page => 4)
    @widgets = @webpage.widgets.for_page(true, 3)
    @contact = Contact.new if ['contact', 'treasures'].include?(@webpage.page_alias)
---
SELECT `webpages`.* FROM `webpages` WHERE (page_alias NOT IN ('about','contact') AND is_root != 1 AND enabled = 1)
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM `subpages` WHERE (`subpages`.webpage_id = 3)) AS subquery
SELECT `subpages`.* FROM `subpages` WHERE (`subpages`.webpage_id = 1) LIMIT 0, 4
SELECT `webpages`.* FROM `webpages`
SELECT `widgets`.* FROM `widgets` WHERE (`widgets`.gadget_id = 1 AND `widgets`.gadget_type = 'Webpage') AND (widget NOT IN (70,10) AND position => 0) LIMIT 1

  def edit
    @webpage = Webpage.find(params[:id])
---
SELECT `webpages`.* FROM `webpages` WHERE (page_alias NOT IN ('about','contact') AND is_root != 1 AND enabled = 1)

  def update
    @webpage = Webpage.find(params[:id])
    @webpage.images.build(params[:images]) if params[:images]
    @webpage.widgets.build(params[:widgets]) if params[:widgets]

    if @webpage.update_attributes(params[:webpage])
---
SELECT `webpages`.* FROM `webpages` WHERE (page_alias NOT IN ('about','contact') AND is_root != 1 AND enabled = 1)
UPDATE `webpages` SET `is_root` = 0, `updated_at` = '2011-05-01 17:44:15' WHERE (`webpages`.`id` = 1)

  def set_accessability
    webpage = Webpage.find(params[:web].to_i)
    subpages = webpage.subpages
    enable = params[:enable] == "true"

    respond_to do |format|
      format.html {}
      format.js do
        webpage.update_attribute('enabled', enable)
        subpages.each { |sub| sub.update_attribute('enabled', enable) } unless enable
---
SELECT `webpages`.* FROM `webpages` WHERE (page_alias NOT IN ('about','contact') AND is_root != 1 AND enabled = 1)
UPDATE `subpages` SET `enabled` = 0, `updated_at` = '2011-04-10 21:11:02' WHERE (`subpages`.`id` = 4)
UPDATE `webpages` SET `enabled` = 1, `updated_at` = '2011-04-10 17:58:30' WHERE (`webpages`.`id` = 3)
SELECT `subpages`.* FROM `subpages` WHERE (`subpages`.webpage_id = 3) AND (`subpages`.`enabled` = 1)