app/controllers/widgets_controller.rb

SELECT `widgets`.* FROM `widgets` WHERE (`widgets`.gadget_id = 2 AND `widgets`.gadget_type = 'Subpage') AND (`widgets`.`enabled` = 1) AND (`widgets`.`widget` = 10) LIMIT 1
DELETE FROM `widgets` WHERE (`widgets`.`id` = 8)
INSERT INTO `widgets` (`content`, `created_at`, `enabled`, `gadget_id`, `gadget_type`, `position`, `updated_at`, `widget`) VALUES (NULL, '2011-05-01 17:44:31', 1, 1, 'Webpage', 0, '2011-05-01 17:44:31', 10)
---
  def create
    object = params[:type].constantize.find(params[:object_id].to_i)
    enabled = [Widget::Template::SLIDESHOW, Widget::Template::GALLERY].include? params[:widget].to_i
    unless params[:widget] == '0'
      @widget = Widget.new({:gadget_type => params[:type], :gadget_id => params[:object_id].to_i, :widget => params[:widget].to_i, :enabled => enabled})
    else
      Widget.destroy_widget(object)
    end

    respond_to do |format|
      format.html {}
      format.js do
        @widget.save unless @widget.nil?