app/views/subpages/_subpage_desc.html.haml

  %h2= subpage_desc.page_title
  = image_tag subpage_desc.images.first_enabled.attachment.url(:sm_preview), {:alt => subpage_desc.images.first_enabled.attachment_file_name} if subpage_desc.has_enabled_images?
---
SELECT `images`.* FROM `images` WHERE (`images`.attachable_id = 4 AND `images`.attachable_type = 'Subpage') AND (`images`.`enabled` = 1) ORDER BY position LIMIT 1