app/views/images/_single_image.html.haml

SELECT `images`.* FROM `images` WHERE (`images`.attachable_id = 1 AND `images`.attachable_type = 'Webpage') AND (`images`.`enabled` = 1) ORDER BY position LIMIT 1
---
= image_tag object.images.first_enabled.url(:slideshow), {:alt => object.images.first_enabled.caption, :title => object.images.first_enabled.caption}